app/controllers/images_controller.rb

SELECT "images".* FROM "images" WHERE "images"."user_id" = $1  [["user_id", 1]]
---
	def index
		if user_signed_in?
			@search = params[:search]
			if @search
				@images = Image.search(@search, current_user)

INSERT INTO "images" ("description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["description", "This is a baby dog."], ["created_at", "2016-01-09 21:42:07.076963"], ["updated_at", "2016-01-09 21:42:07.076963"]]
---
	def create
		@image = current_user.images.new(image_params)

		if @image.save

SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT 1  [["id", 11]]
---
	def edit
		@image = Image.find(params[:id])

SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT 1  [["id", 2]]
---
	def show
		@image = Image.find(params[:id])

SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT 1  [["id", 11]]
DELETE FROM "images" WHERE "images"."id" = $1  [["id", 11]]
---
	def destroy
		@image = Image.find(params[:id])
  		@image.destroy

SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT 1  [["id", 11]]
UPDATE "images" SET "description" = $1, "updated_at" = $2 WHERE "images"."id" = $3  [["description", "This should be associated "], ["updated_at", "2016-01-10 16:31:18.504708"], ["id", 11]]
---
	def update
		@image = Image.find(params[:id])

		if @image.update(image_params)