app/views/images/show.html.erb

<div><%= @image.description %></div>
<div>Tags: <%= @image.tags.all %>
---
SELECT "tags".* FROM "tags" INNER JOIN "images_tags" ON "tags"."id" = "images_tags"."tag_id" WHERE "images_tags"."image_id" = $1  [["image_id", 2]]